YOBS/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
  	puts "*"*30
  	p params
	puts "*"*30
  	@category = Category.find(params[:id])