YOBS/app/controllers/users_controller.rb

  def create
    @user = User.new (params[:user])
    @user.password = params[:password]
    @user.save!
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_hash", "updated_at", "user_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def login
    @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1