app/views/jobs/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <select name="category" id="category" >
    	<%Category.all.each do |category|%>