app/views/agencies/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "users_jobs" ON "users"."id" = "users_jobs"."user_id" WHERE "users_jobs"."job_id" = 2
---
			<div class="agency-job-footer">
				<%if job.users.length > 0%>