app/controllers/agencies_controller.rb

	def show
		@agency = Agency.find(params[:id])
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT 1  [["id", "4"]]