app/controllers/jobs_controller.rb

	def create
		# @agency = params[:agency_id]
		# job = Job.new(params[:job])
		# job.category_id = params[:category]
		# job.agency_id = params[:agency_id]
		######### shadi recommended refactor
		@agency = Agency.find params[:agency_id]
		@job = @agency.jobs.build(params[:job])
		@job.category = Category.find(params[:category])
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = 4 LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1